month = int(input("Введите месяц в формате от 1 до 12:"))

seasons = {"Зима": (12, 1, 2), "Весна": (3, 4, 5), "Лето": (6, 7, 8), "Осень": (9, 10, 11)}
if 1 <= month <= 12:
    for i in seasons.items():
        if month in i[1]:
            print(i[0])
else:
    print("Введите корректно месяц от 1 до 12")

# seasons = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето",
#            9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}
# for key in seasons.keys():
#     if month == key:
#         print(seasons.get(key))
